// tag::pyspark-results[]
+----+-----------------+---+----------------+---+
|from|               e0| v1|              e1| to|
+----+-----------------+---+----------------+---+
| [A]|[A, D, ROAD, 100]|[D]|[D, F, ROAD, 80]|[F]|
+----+-----------------+---+----------------+---+
// end::pyspark-results[]


// tag::neo4j-execute[]
MATCH (start:Loc {id:"A"}), (end:Loc {id:"F"})
CALL algo.shortestPath.stream(start, end, "cost")
YIELD nodeId, cost
MATCH (other:Loc) WHERE id(other) = nodeId
RETURN other.id AS location, cost
// end::neo4j-execute[]

// tag::neo4j-results[]
+--------------------+
| place       | cost |
+--------------------+
| "Amsterdam" | 0.0  |
| "Immingham" | 1.0  |
| "Doncaster" | 2.0  |
| "London"    | 3.0  |
+--------------------+
// end::neo4j-results[]


// tag::neo4j-weighted-results[]
+----------------------------+
| place              | cost  |
+----------------------------+
| "Amsterdam"        | 0.0   |
| "Den Haag"         | 59.0  |
| "Hoek van Holland" | 86.0  |
| "Felixstowe"       | 293.0 |
| "Ipswich"          | 315.0 |
| "Colchester"       | 347.0 |
| "London"           | 453.0 |
+----------------------------+
// end::neo4j-weighted-results[]

// tag::neo4j-unweighted-results[]
+--------------------+
| place       | cost |
+--------------------+
| "Amsterdam" | 0.0  |
| "Immingham" | 1.0  |
| "Doncaster" | 2.0  |
| "London"    | 3.0  |
+--------------------+
// end::neo4j-unweighted-results[]

// tag::neo4j-unweighted-calculate-costs-results[]
+--------------------+
| place       | cost |
+--------------------+
| "Amsterdam" | 0    |
| "Immingham" | 369  |
| "Doncaster" | 443  |
| "London"    | 720  |
+--------------------+
// end::neo4j-unweighted-calculate-costs-results[]