// tag::neo4j-execute[]
CALL algo.closeness.stream("User", "FOLLOWS")
YIELD nodeId, centrality
MATCH (n) WHERE id(n) = nodeId
RETURN n.id AS user, centrality
ORDER BY centrality DESC
// end::neo4j-execute[]

// tag::neo4j-results[]
+--------------------------------+
| user      | centrality         |
+--------------------------------+
| "Alice"   | 1.0                |
| "Doug"    | 1.0                |
| "David"   | 1.0                |
| "Bridget" | 0.7142857142857143 |
| "Michael" | 0.7142857142857143 |
| "Amy"     | 0.6666666666666666 |
| "James"   | 0.6666666666666666 |
| "Charles" | 0.625              |
| "Mark"    | 0.625              |
+--------------------------------+
// end::neo4j-results[]

// tag::neo4j-execute-harmonic[]
CALL algo.closeness.harmonic.stream("User", "FOLLOWS")
YIELD nodeId, centrality
MATCH (n) WHERE id(n) = nodeId
RETURN n.id AS user, centrality
ORDER BY centrality DESC
// end::neo4j-execute-harmonic[]

// tag::neo4j-results-harmonic[]
+------------------------+
| user      | centrality |
+------------------------+
| "Alice"   | 0.625      |
| "Doug"    | 0.625      |
| "Bridget" | 0.5        |
| "Michael" | 0.5        |
| "Charles" | 0.4375     |
| "Mark"    | 0.4375     |
| "David"   | 0.25       |
| "Amy"     | 0.1875     |
| "James"   | 0.1875     |
+------------------------+
// end::neo4j-results-harmonic[]