// tag::neo4j-import-nodes[]
LOAD CSV WITH HEADERS FROM "file:///cc-nodes.csv" AS row
MERGE (:Node {id:row.id})
// end::neo4j-import-nodes[]

// tag::neo4j-import-relationships[]
LOAD CSV WITH HEADERS FROM "file:///cc-relationships.csv" AS row
MATCH (source:Node {id: row.src})
MATCH (destination:Node {id: row.dst})
MERGE (source)-[:LINK]->(destination)
// end::neo4j-import-relationships[]

// tag::neo4j-execute[]
CALL algo.closeness.stream("Node", "LINK")
YIELD nodeId, centrality
MATCH (n:Node) WHERE id(n) = nodeId
RETURN n.id AS node, centrality
ORDER BY centrality DESC
LIMIT 20;
// end::neo4j-execute[]

// tag::neo4j-results[]
+----+------------------+
|node|        centrality|
+----+------------------+
|   C|0.6666666666666666|
|   B|0.5714285714285714|
|   D|0.5714285714285714|
|   A|               0.4|
|   E|               0.4|
+----+------------------+
// end::neo4j-results[]

// tag::neo4j-execute-harmonic[]
CALL algo.closeness.harmonic.stream("Node", "LINK")
YIELD nodeId, centrality
MATCH (n:Node) WHERE id(n) = nodeId
RETURN n.id AS node, centrality
ORDER BY centrality DESC
LIMIT 20;
// end::neo4j-execute-harmonic[]

// tag::neo4j-results-harmonic[]
+----+------------------+
|node|        centrality|
+----+------------------+
|   C|              0.75|
|   B|0.7083333333333334|
|   D|0.7083333333333334|
|   A|0.5208333333333333|
|   E|0.5208333333333333|
+----+------------------+
// end::neo4j-results-harmonic[]