// tag::neo4j-execute[]
CALL algo.closeness.stream("User", "FOLLOWS")
YIELD nodeId, centrality
MATCH (n) WHERE id(n) = nodeId
RETURN n.id AS user, centrality
ORDER BY centrality DESC
// end::neo4j-execute[]

// tag::neo4j-results[]
+--------------------------------+
| user      | centrality         |
+--------------------------------+
| "Alice"   | 1.0                |
| "Doug"    | 1.0                |
| "Bridget" | 0.7142857142857143 |
| "Michael" | 0.7142857142857143 |
| "Charles" | 0.625              |
| "Mark"    | 0.625              |
+--------------------------------+
// end::neo4j-results[]

// tag::neo4j-execute-harmonic[]
CALL algo.closeness.harmonic.stream("User", "FOLLOWS")
YIELD nodeId, centrality
MATCH (n) WHERE id(n) = nodeId
RETURN n.id AS user, centrality
ORDER BY centrality DESC
// end::neo4j-execute-harmonic[]

// tag::neo4j-results-harmonic[]
+------------------------+
| user      | centrality |
+------------------------+
| "Alice"   | 1.0        |
| "Doug"    | 1.0        |
| "Bridget" | 0.8        |
| "Michael" | 0.8        |
| "Charles" | 0.7        |
| "Mark"    | 0.7        |
+------------------------+
// end::neo4j-results-harmonic[]