// tag::neo4j-execute[]
CALL algo.betweenness.stream("User", "FOLLOWS")
YIELD nodeId, centrality
MATCH (user:User) WHERE id(user) = nodeId
RETURN user.id AS user,centrality
ORDER BY centrality DESC
// end::neo4j-execute[]

// tag::neo4j-results[]
+------------------------+
| user      | centrality |
+------------------------+
| "Alice"   | 10.0       |
| "Doug"    | 7.0        |
| "Mark"    | 7.0        |
| "Bridget" | 0.0        |
| "Charles" | 0.0        |
| "Michael" | 0.0        |
+------------------------+
// end::neo4j-results[]

// tag::neo4j-execute-approx[]
CALL algo.betweenness.sampled.stream("User", "FOLLOWS",
 {strategy:"random", probability:1.0, maxDepth:1})
YIELD nodeId, centrality
MATCH (user) WHERE id(user) = nodeId
RETURN user.id AS user,centrality
ORDER BY centrality DESC
// end::neo4j-execute-approx[]

// tag::neo4j-results-approx[]
+-------+----------+
|   user|centrality|
+-------+----------+
|  Alice|       3.0|
|Charles|       1.0|
|Bridget|       0.0|
|   Doug|       0.0|
|   Mark|       0.0|
|Michael|       0.0|
+-------+----------+
// end::neo4j-results-approx[]